#----------------------------------- https://github.com/m4mallu/clonebot --------------------------------------------#
class Presets(object):
    WELCOME_TEXT = "Hello.. <b>{}</b>\n<code>I can copy your entire messages from one chat to another ! Try</code>\n" \
                   " /help <code>for how to use the bot.</code>\n\n<b>My Author is: " \
                   "</b><a href='https://t.me/space4renjith'>                 HERE</a>\n" \
                   "<b>My code can be seen: </b><a href='https://github.com/m4mallu/clonebot'> HERE</a>"
    HELP_TEXT = """<a href='https://github.com/m4mallu/clonebot'>𝙃𝙚𝙡𝙡𝙤.. 𝙄'𝙢 𝘾𝙡𝙤𝙣𝙚 𝘽𝙤𝙩</a>

ɪ ᴄᴀɴ ᴄʟᴏɴᴇ ᴍᴇᴅɪᴀꜱ ꜰʀᴏᴍ ᴏɴᴇ ᴄʜᴀᴛ ᴛᴏ ᴀɴᴏᴛʜᴇʀ

𝔸𝕥𝕥𝕖𝕟𝕥𝕚𝕠𝕟:
𝘽𝙤𝙩 𝙢𝙪𝙨𝙩 𝙗𝙚 𝙖𝙣 𝙖𝙙𝙢𝙞𝙣 𝙤𝙛 𝙩𝙝𝙚 𝙨𝙤𝙪𝙧𝙘𝙚 𝙖𝙣𝙙 𝙙𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩𝙨 !
ᴺᵒ ⁿᵉᵉᵈ ᶠᵒʳ ˢᵗʳⁱⁿᵍ ˢᵉˢˢⁱᵒⁿ ᵘˢᵉʳ ᵗᵒ ᵇᵉ ʲᵒⁱⁿᵉᵈ

ℙ𝕣𝕠𝕔𝕖𝕕𝕦𝕣𝕖:
🔵 𝐒𝐞𝐭 𝐚 𝐬𝐨𝐮𝐫𝐜𝐞 𝐜𝐡𝐚𝐭 :
/𝚜𝚘𝚞𝚛𝚌𝚎<𝚜𝚙𝚊𝚌𝚎>𝚌𝚑𝚊𝚝.𝚒𝚍
𝙀𝙜: <b>/source</b> <code>-1001234567890</code>

🔵 𝐒𝐞𝐭 𝐚 𝐝𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧 𝐜𝐡𝐚𝐭 :
/𝚍𝚎𝚜𝚝𝚒𝚗𝚊𝚝𝚒𝚘𝚗<𝚜𝚙𝚊𝚌𝚎>𝚌𝚑𝚊𝚝.𝚒𝚍
𝙀𝙜: <b>/destination</b> <code>-1000987654321</code>

🔵 𝐓𝐨 𝐯𝐢𝐞𝐰 𝐭𝐡𝐞 𝐬𝐭𝐨𝐫𝐞𝐝 𝐜𝐡𝐚𝐭 𝐜𝐨𝐧𝐟𝐢𝐠 :
𝐒𝐞𝐧𝐝 : <b>/view</b>

🔵 𝐅𝐢𝐧𝐚𝐥𝐥𝐲.. 𝐄𝐱𝐞𝐜𝐮𝐭𝐞 :
𝐒𝐞𝐧𝐝 : <b>/clone</b>

ℙ𝕝𝕖𝕒𝕤𝕖 ℕ𝕠𝕥𝕖:
🟡 𝐀𝐥𝐥 𝐭𝐡𝐞 𝐚𝐛𝐨𝐯𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐬𝐡𝐨𝐮𝐥𝐝 𝐛𝐞 𝐞𝐱𝐞𝐜𝐮𝐭𝐞𝐝 𝐢𝐧 𝐛𝐨𝐭 𝐢𝐭𝐬𝐞𝐥𝐟.

🟡 𝐏𝐫𝐞𝐬𝐞𝐧𝐭𝐥𝐲 𝐬𝐮𝐩𝐩𝐨𝐫𝐭𝐞𝐝 𝐟𝐢𝐥𝐞 𝐭𝐲𝐩𝐞𝐬 𝐚𝐫𝐞 𝐃𝐨𝐜𝐮𝐦𝐞𝐧𝐭𝐬, 𝐕𝐢𝐝𝐞𝐨 𝐚𝐧𝐝 𝐀𝐮𝐝𝐢𝐨.

🟡 𝐒𝐨𝐮𝐫𝐜𝐞 𝐚𝐧𝐝 𝐃𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧 𝐜𝐡𝐚𝐭𝐬 𝐦𝐮𝐬𝐭 𝐛𝐞 𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐞𝐝 𝐛𝐞𝐟𝐨𝐫𝐞 𝐬𝐭𝐚𝐫𝐭𝐢𝐧𝐠 𝐭𝐡𝐞 𝐩𝐫𝐨𝐜𝐞𝐝𝐮𝐫𝐞.

🟡 𝐀𝐟𝐭𝐞𝐫 𝐜𝐨𝐦𝐩𝐥𝐞𝐭𝐢𝐧𝐠 𝐭𝐡𝐞 𝐩𝐫𝐨𝐜𝐞𝐝𝐮𝐫𝐞, 𝐚𝐥𝐥 
𝐭𝐡𝐞 𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐚𝐭𝐢𝐨𝐧𝐬 𝐰𝐢𝐥𝐥 𝐛𝐞 𝐫𝐞𝐬𝐞𝐭 𝐭𝐨 𝐝𝐞𝐟𝐚𝐮𝐥𝐭𝐬 𝐭𝐨 𝐚𝐯𝐨𝐢𝐝 𝐦𝐞𝐝𝐢𝐚 𝐝𝐮𝐩𝐥𝐢𝐜𝐚𝐭𝐢𝐨𝐧.
    
    """
    MESSAGE_COUNT = "𝗬𝗼𝘂'𝘃𝗲 𝗰𝗼𝗽𝗶𝗲𝗱 : \n\n📚 𝐃𝐨𝐜𝐮𝐦𝐞𝐧𝐭𝐬 <b>: {}</b>\n🎞 𝐕𝐢𝐝𝐞𝐨𝐬         <b>: {}</b>\n" \
                    "🔊 𝐀𝐮𝐝𝐢𝐨𝐬         <b>: {}</b>\n\n<code>Be patient, You will get a confirmation when" \
                    " finished !</code>"
    COPYING_MESSAGES = "<b>Copying Medias...</b>"
    IN_CORRECT_PERMISSIONS_MESSAGE = "something went wrong.\n\n<code>{}</code>\n\n</b>Make sure, Bot Needs all Admin " \
                                     "privileges.</b>"
    COPIED_MESSAGES = "<b><a href='https://github.com/m4mallu/clonebot'>Medias Copied</a></b>"
    FILE_TYPES = ["document", "video", "audio"]
    COPY_ERROR_TEXT = "⛔ ️𝘼𝙘𝙘𝙚𝙨𝙨 𝘿𝙚𝙣𝙞𝙚𝙙 ⛔\n\n𝐂𝐡𝐞𝐜𝐤.. 𝐁𝐨𝐭 𝐢𝐬 𝐚𝐧 𝐚𝐝𝐦𝐢𝐧 𝐨𝐟 𝐭𝐡𝐞 𝐜𝐡𝐚𝐭𝐬 𝐰𝐢𝐭𝐡 𝐚𝐥𝐥 𝐚𝐝𝐦𝐢𝐧 𝐩𝐫𝐢𝐯𝐢𝐥𝐞𝐠𝐞𝐬 ❗️"
    INITIAL_MESSAGE_TEXT = "🔎 𝐋𝐨𝐨𝐤𝐢𝐧𝐠 𝐟𝐨𝐫 𝐌𝐞𝐝𝐢𝐚𝐬 🔎"
    SOURCE_CONFIRM = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐜𝐡𝐚𝐭 𝐈𝐝 👉 <code>{}</code>\n\n𝐒𝐚𝐯𝐞𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
    DESTINATION_CONFIRM = "𝐓𝐚𝐫𝐠𝐞𝐭 𝐜𝐡𝐚𝐭 𝐈𝐝 👉 <code>{}</code>\n\n𝐒𝐚𝐯𝐞𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
    VIEW_CONF = "⚙️ 𝐘𝐨𝐮𝐫 𝐛𝐨𝐭 𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐚𝐭𝐢𝐨𝐧𝐬 ⚙️\n\n🍾 𝐒𝐨𝐮𝐫𝐜𝐞 𝐈𝐝         : <code>{}</code>\n🎯 𝐃𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧 𝐈𝐝 : " \
                "<code>{}</code>"
    NOT_CONFIGURED = "𝐍𝐨 𝐜𝐡𝐚𝐭 𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐚𝐭𝐢𝐨𝐧 𝐟𝐨𝐮𝐧𝐝 ⚠ \n\n𝐓𝐫𝐲 : <b>/help</b>"
    TRY_HELP = "𝐓𝐫𝐲 : /help\n\n𝐓𝐨 𝐤𝐧𝐨𝐰 𝐛𝐞𝐭𝐭𝐞𝐫 𝐮𝐬𝐞 𝐨𝐟 𝐭𝐡𝐢𝐬 𝐛𝐨𝐭 🤷"
    FINISHED_TEXT = "𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐮𝐥𝐚𝐭𝐢𝐨𝐧𝐬 🥂\n\n𝐌𝐞𝐝𝐢𝐚𝐬 𝐜𝐥𝐨𝐧𝐞𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
    INVALID_CHAT_ID = "𝐈𝐧𝐯𝐚𝐥𝐢𝐝 𝐜𝐡𝐚𝐭 𝐩𝐚𝐫𝐚𝐦𝐞𝐭𝐞𝐫 𝐟𝐨𝐮𝐧𝐝 🤷"
    CLEAR_CONFIG = "𝐂𝐡𝐚𝐭 𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐚𝐭𝐢𝐨𝐧𝐬:\n\n𝐂𝐥𝐞𝐚𝐫𝐞𝐝 𝐒𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
